test/data/cds_status/9-awaiting-ipaff-cr.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <soap:Header>
    <oas:Security soap:role="system" soap:mustUnderstand="true">
      <oas:UsernameToken>
        <oas:Username>systemID=ALVSHMRCCDS,ou=gsi systems,o=defra</oas:Username>
        <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</oas:Password>
      </oas:UsernameToken>
    </oas:Security>
  </soap:Header>
  <soap:Body>
    <ALVSClearanceRequest xmlns="http://submitimportdocumenthmrcfacade.types.esb.ws.cara.defra.com">
      <ServiceHeader>
        <SourceSystem>CDS</SourceSystem>
        <DestinationSystem>ALVS</DestinationSystem>
        <CorrelationId>CDMA128009</CorrelationId>
        <ServiceCallTimestamp>2025-11-05T09:01:00.5553237Z</ServiceCallTimestamp>
      </ServiceHeader>
      <Header>
        <EntryReference>24GBBGBKCDMA128009</EntryReference>
        <EntryVersionNumber>2</EntryVersionNumber>
        <PreviousVersionNumber>1</PreviousVersionNumber>
        <DeclarationUCR>4GB269573944000-PORTACDMA128009</DeclarationUCR>
        <DeclarationPartNumber />
        <DeclarationType>F</DeclarationType>
        <ArrivalDateTime />
        <SubmitterTURN>GB269573944000</SubmitterTURN>
        <DeclarantId>GB269573944000</DeclarantId>
        <DeclarantName>GB269573944000</DeclarantName>
        <DispatchCountryCode>IT</DispatchCountryCode>
        <GoodsLocationCode>DEUDEUDEUGVM</GoodsLocationCode>
        <MasterUCR />
      </Header>
      <Item>
        <ItemNumber>1</ItemNumber>
        <CustomsProcedureCode>40001CG</CustomsProcedureCode>
        <TaricCommodityCode>1601009105</TaricCommodityCode>
        <GoodsDescription>SALSICCIA PURO SUINO</GoodsDescription>
        <ConsigneeId>GB930101485000</ConsigneeId>
        <ConsigneeName>GB930101485000</ConsigneeName>
        <ItemNetMass>50</ItemNetMass>
        <ItemSupplementaryUnits>100</ItemSupplementaryUnits>
        <ItemThirdQuantity />
        <ItemOriginCountryCode>IT</ItemOriginCountryCode>
        <Document>
          <DocumentCode>C640</DocumentCode>
          <DocumentReference>CHEDA.GB.2025.1112809</DocumentReference>
          <DocumentStatus>AE</DocumentStatus>
          <DocumentControl>P</DocumentControl>
          <DocumentQuantity />
        </Document>
        <Check>
          <CheckCode>H221</CheckCode>
          <DepartmentCode>AHVLA</DepartmentCode>
        </Check>
      </Item>
    </ALVSClearanceRequest>
  </soap:Body>
</soap:Envelope>